[Killed] BlockStatement
smarttesting-js/08-04-mutation/src/customer.js:1:32
-const verifyID = (customer) => {
-  const id = customer.id
-  const stringId = '' + parseInt(id)
-  return stringId.length == 11
-}
+const verifyID = (customer) => {}
 
 const verifyAge = (customer) => {

[Killed] ArithmeticOperator
smarttesting-js/08-04-mutation/src/customer.js:3:20
 const verifyID = (customer) => {
   const id = customer.id
-  const stringId = '' + parseInt(id)
+  const stringId = '' - parseInt(id)
   return stringId.length == 11
 }

[Killed] ConditionalExpression
smarttesting-js/08-04-mutation/src/customer.js:4:10
 const verifyID = (customer) => {
   const id = customer.id
   const stringId = '' + parseInt(id)
-  return stringId.length == 11
+  return true
 }
 

[Killed] ConditionalExpression
smarttesting-js/08-04-mutation/src/customer.js:4:10
 const verifyID = (customer) => {
   const id = customer.id
   const stringId = '' + parseInt(id)
-  return stringId.length == 11
+  return false
 }
 

[Killed] BlockStatement
smarttesting-js/08-04-mutation/src/customer.js:7:33
   return stringId.length == 11
 }
 
-const verifyAge = (customer) => {
-  const age = customer.age
-  if (age < 0){
-    return false
-  }
-  else if (age > 18 && age < 99) {
-    return true
-  } else {
-    return false
-  }
-}
+const verifyAge = (customer) => {}
 
 module.exports = {

[Killed] EqualityOperator
smarttesting-js/08-04-mutation/src/customer.js:9:7
 
 const verifyAge = (customer) => {
   const age = customer.age
-  if (age < 0){
+  if (age >= 0){
     return false
   }

[Killed] ConditionalExpression
smarttesting-js/08-04-mutation/src/customer.js:9:7
 
 const verifyAge = (customer) => {
   const age = customer.age
-  if (age < 0){
+  if (true){
     return false
   }

[NoCoverage] BooleanLiteral
smarttesting-js/08-04-mutation/src/customer.js:10:12
 const verifyAge = (customer) => {
   const age = customer.age
   if (age < 0){
-    return false
+    return true
   }
   else if (age > 18 && age < 99) {

[Killed] EqualityOperator
smarttesting-js/08-04-mutation/src/customer.js:12:24
   if (age < 0){
     return false
   }
-  else if (age > 18 && age < 99) {
+  else if (age > 18 && age >= 99) {
     return true
   } else {

[Killed] LogicalOperator
smarttesting-js/08-04-mutation/src/customer.js:12:12
   if (age < 0){
     return false
   }
-  else if (age > 18 && age < 99) {
+  else if (age > 18 || age < 99) {
     return true
   } else {

[Killed] BooleanLiteral
smarttesting-js/08-04-mutation/src/customer.js:13:12
     return false
   }
   else if (age > 18 && age < 99) {
-    return true
+    return false
   } else {
     return false

[Survived] BlockStatement
smarttesting-js/08-04-mutation/src/customer.js:14:10
   }
   else if (age > 18 && age < 99) {
     return true
-  } else {
-    return false
-  }
+  } else {}
 }
 
